---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailInside
source: html/da015aec-2e82-8f0d-e552-b36942a56c4b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailInside Property

"Inside"

## Syntax (C#)
```csharp
public static ForgeTypeId RepeatingDetailInside { get; }
```